<template>
    <div class="cntr-bg">
        <div class="h-50">
            <div class="cntr-part-left">
                <div class="text-1 mb-36">SPROOT</div>
                <part-left-item textItem="Создание доставок" />
                
                
                <part-left-item textItem="Запуск доставок" />
                <!-- <div class="cntr center box-size box-padding mt-36">
                    <div class="text-3">Управление рекламой</div>
                    <svg class="mr-14" width="12" height="8" viewBox="0 0 12 8" fill="" stroke="#3B82F6"
                        xmlns="http://www.w3.org/2000/svg">
                        <path fill-rule="evenodd" clip-rule="evenodd"
                            d="M6.30969 6.93476C6.26905 6.9755 6.22077 7.00783 6.16762 7.02988C6.11446 7.05194 6.05748 7.06329 5.99994 7.06329C5.94239 7.06329 5.88541 7.05194 5.83226 7.02988C5.77911 7.00783 5.73083 6.9755 5.69019 6.93476L0.440187 1.68476C0.358037 1.60261 0.311884 1.49119 0.311884 1.37501C0.311884 1.25883 0.358037 1.14741 0.440187 1.06526C0.522337 0.98311 0.633758 0.936958 0.749938 0.936958C0.866116 0.936958 0.977537 0.98311 1.05969 1.06526L5.99994 6.00639L10.9402 1.06526C11.0223 0.983111 11.1338 0.936959 11.2499 0.936959C11.3661 0.936959 11.4775 0.983111 11.5597 1.06526C11.6418 1.14741 11.688 1.25883 11.688 1.37501C11.688 1.49119 11.6418 1.60261 11.5597 1.68476L6.30969 6.93476Z"
                            fill="#374151" />
                    </svg>
                    
                </div>
                <div class="cntr-part-left-2">
                    <div class="box-item text-2 box-padding">Настройка сегментов доставок</div>
                    <div class="box-item box-select text-2 box-padding">Аудитории</div>
                </div> -->
                <part-left-item textItem="Управление рекламой" />
                <part-left-item textItem="Мониторинг рекламных компаний" />
                <part-left-item textItem="Оптимизация доставок" />
                <part-left-item textItem="Статистика" />
                <!-- <part-left-item textItem="Настройки" /> -->
                <div class="cntr center box-size box-padding mt-36">
                    <div class="text-3">Настройки</div>
                    <svg class="mr-14" width="12" height="8" viewBox="0 0 12 8" fill="" stroke="#3B82F6"
                        xmlns="http://www.w3.org/2000/svg">
                        <path fill-rule="evenodd" clip-rule="evenodd"
                            d="M6.30969 6.93476C6.26905 6.9755 6.22077 7.00783 6.16762 7.02988C6.11446 7.05194 6.05748 7.06329 5.99994 7.06329C5.94239 7.06329 5.88541 7.05194 5.83226 7.02988C5.77911 7.00783 5.73083 6.9755 5.69019 6.93476L0.440187 1.68476C0.358037 1.60261 0.311884 1.49119 0.311884 1.37501C0.311884 1.25883 0.358037 1.14741 0.440187 1.06526C0.522337 0.98311 0.633758 0.936958 0.749938 0.936958C0.866116 0.936958 0.977537 0.98311 1.05969 1.06526L5.99994 6.00639L10.9402 1.06526C11.0223 0.983111 11.1338 0.936959 11.2499 0.936959C11.3661 0.936959 11.4775 0.983111 11.5597 1.06526C11.6418 1.14741 11.688 1.25883 11.688 1.37501C11.688 1.49119 11.6418 1.60261 11.5597 1.68476L6.30969 6.93476Z"
                            fill="#374151" />
                    </svg>
                    
                </div>
                <div class="cntr-part-left-2">
                    <div class="box-item text-2 box-padding">Настройка ТГ-чатов</div>
                    <div class="box-item box-select text-2 box-padding">Тип сети</div>
                    <!-- <div class="box-item text-2 box-padding">Настройка лимитов, ставок, закупки</div>
                    <div class="box-item text-2 box-padding">Настройка сегментов</div> -->
                </div>
            </div>


        </div>

        <div class="h-50 cntr a-e ">
            <div>
                <div class="cntr-white ml-20 w-205">
                    <svg width="12" height="12" viewBox="0 0 12 12" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path
                            d="M6 6C6.69619 6 7.36387 5.72344 7.85616 5.23116C8.34844 4.73887 8.625 4.07119 8.625 3.375C8.625 2.67881 8.34844 2.01113 7.85616 1.51884C7.36387 1.02656 6.69619 0.75 6 0.75C5.30381 0.75 4.63613 1.02656 4.14384 1.51884C3.65156 2.01113 3.375 2.67881 3.375 3.375C3.375 4.07119 3.65156 4.73887 4.14384 5.23116C4.63613 5.72344 5.30381 6 6 6ZM7.75 3.375C7.75 3.83913 7.56563 4.28425 7.23744 4.61244C6.90925 4.94063 6.46413 5.125 6 5.125C5.53587 5.125 5.09075 4.94063 4.76256 4.61244C4.43437 4.28425 4.25 3.83913 4.25 3.375C4.25 2.91087 4.43437 2.46575 4.76256 2.13756C5.09075 1.80937 5.53587 1.625 6 1.625C6.46413 1.625 6.90925 1.80937 7.23744 2.13756C7.56563 2.46575 7.75 2.91087 7.75 3.375ZM11.25 10.375C11.25 11.25 10.375 11.25 10.375 11.25H1.625C1.625 11.25 0.75 11.25 0.75 10.375C0.75 9.5 1.625 6.875 6 6.875C10.375 6.875 11.25 9.5 11.25 10.375ZM10.375 10.3715C10.3741 10.1562 10.2403 9.50875 9.647 8.9155C9.0765 8.345 8.00287 7.75 6 7.75C3.99625 7.75 2.9235 8.345 2.353 8.9155C1.75975 9.50875 1.62675 10.1562 1.625 10.3715H10.375Z"
                            fill="#374151" />
                    </svg>
                    <div class="text-4 ml-10">
                        demo@demo.ru
                    </div>
                </div>
                <div class="mt-8 mb-34 cntr">
                    <div class="box-btn text-btn j-c a-c cntr ml-20">Выйти</div>
                    <div class="cntr-white w-138 ml-8">
                        <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <g clip-path="url(#clip0_35_70236)">
                                <path
                                    d="M8 10C9.10457 10 10 9.10457 10 8C10 6.89543 9.10457 6 8 6C6.89543 6 6 6.89543 6 8C6 9.10457 6.89543 10 8 10Z"
                                    stroke="#374151" stroke-width="1.33333" stroke-linecap="round"
                                    stroke-linejoin="round" />
                                <path
                                    d="M12.9334 10C12.8447 10.2011 12.8182 10.4241 12.8574 10.6404C12.8966 10.8567 12.9997 11.0562 13.1534 11.2133L13.1934 11.2533C13.3174 11.3772 13.4157 11.5242 13.4828 11.6861C13.5499 11.8479 13.5845 12.0215 13.5845 12.1967C13.5845 12.3719 13.5499 12.5454 13.4828 12.7073C13.4157 12.8691 13.3174 13.0162 13.1934 13.14C13.0696 13.264 12.9225 13.3623 12.7607 13.4294C12.5988 13.4965 12.4253 13.5311 12.2501 13.5311C12.0749 13.5311 11.9014 13.4965 11.7395 13.4294C11.5776 13.3623 11.4306 13.264 11.3067 13.14L11.2667 13.1C11.1096 12.9463 10.9101 12.8432 10.6938 12.804C10.4775 12.7648 10.2545 12.7913 10.0534 12.88C9.85623 12.9645 9.68807 13.1048 9.56962 13.2837C9.45117 13.4626 9.3876 13.6721 9.38675 13.8867V14C9.38675 14.3536 9.24627 14.6928 8.99622 14.9428C8.74617 15.1929 8.40704 15.3333 8.05341 15.3333C7.69979 15.3333 7.36065 15.1929 7.11061 14.9428C6.86056 14.6928 6.72008 14.3536 6.72008 14V13.94C6.71492 13.7193 6.64349 13.5053 6.51509 13.3258C6.38668 13.1463 6.20724 13.0095 6.00008 12.9333C5.799 12.8446 5.57595 12.8181 5.35969 12.8573C5.14343 12.8965 4.94387 12.9996 4.78675 13.1533L4.74675 13.1933C4.62292 13.3173 4.47587 13.4157 4.314 13.4828C4.15214 13.5498 3.97864 13.5844 3.80341 13.5844C3.62819 13.5844 3.45469 13.5498 3.29283 13.4828C3.13096 13.4157 2.98391 13.3173 2.86008 13.1933C2.73611 13.0695 2.63777 12.9225 2.57067 12.7606C2.50357 12.5987 2.46903 12.4252 2.46903 12.25C2.46903 12.0748 2.50357 11.9013 2.57067 11.7394C2.63777 11.5776 2.73611 11.4305 2.86008 11.3067L2.90008 11.2667C3.05377 11.1096 3.15687 10.91 3.19608 10.6937C3.2353 10.4775 3.20882 10.2544 3.12008 10.0533C3.03557 9.85616 2.89525 9.68799 2.71639 9.56954C2.53753 9.45109 2.32794 9.38753 2.11341 9.38667H2.00008C1.64646 9.38667 1.30732 9.2462 1.05727 8.99615C0.807224 8.7461 0.666748 8.40696 0.666748 8.05334C0.666748 7.69972 0.807224 7.36058 1.05727 7.11053C1.30732 6.86048 1.64646 6.72 2.00008 6.72H2.06008C2.28074 6.71484 2.49475 6.64342 2.67428 6.51501C2.85381 6.38661 2.99056 6.20716 3.06675 6C3.15549 5.79893 3.18196 5.57588 3.14275 5.35961C3.10354 5.14335 3.00044 4.94379 2.84675 4.78667L2.80675 4.74667C2.68278 4.62284 2.58443 4.47579 2.51733 4.31393C2.45024 4.15206 2.4157 3.97856 2.4157 3.80334C2.4157 3.62812 2.45024 3.45462 2.51733 3.29275C2.58443 3.13089 2.68278 2.98384 2.80675 2.86C2.93058 2.73604 3.07763 2.63769 3.23949 2.57059C3.40136 2.50349 3.57486 2.46896 3.75008 2.46896C3.9253 2.46896 4.0988 2.50349 4.26067 2.57059C4.42253 2.63769 4.56958 2.73604 4.69341 2.86L4.73341 2.9C4.89053 3.0537 5.09009 3.1568 5.30636 3.19601C5.52262 3.23522 5.74567 3.20875 5.94675 3.12H6.00008C6.19726 3.0355 6.36543 2.89518 6.48388 2.71632C6.60233 2.53746 6.66589 2.32786 6.66675 2.11334V2.00001C6.66675 1.64638 6.80722 1.30724 7.05727 1.0572C7.30732 0.807148 7.64646 0.666672 8.00008 0.666672C8.3537 0.666672 8.69284 0.807148 8.94289 1.0572C9.19294 1.30724 9.33341 1.64638 9.33341 2.00001V2.06C9.33427 2.27453 9.39784 2.48412 9.51629 2.66298C9.63474 2.84184 9.8029 2.98216 10.0001 3.06667C10.2012 3.15541 10.4242 3.18189 10.6405 3.14267C10.8567 3.10346 11.0563 3.00036 11.2134 2.84667L11.2534 2.80667C11.3772 2.6827 11.5243 2.58436 11.6862 2.51726C11.848 2.45016 12.0215 2.41562 12.1967 2.41562C12.372 2.41562 12.5455 2.45016 12.7073 2.51726C12.8692 2.58436 13.0162 2.6827 13.1401 2.80667C13.264 2.9305 13.3624 3.07755 13.4295 3.23942C13.4966 3.40128 13.5311 3.57478 13.5311 3.75C13.5311 3.92523 13.4966 4.09873 13.4295 4.26059C13.3624 4.42246 13.264 4.56951 13.1401 4.69334L13.1001 4.73334C12.9464 4.89046 12.8433 5.09002 12.8041 5.30628C12.7649 5.52254 12.7913 5.74559 12.8801 5.94667V6C12.9646 6.19718 13.1049 6.36535 13.2838 6.4838C13.4626 6.60225 13.6722 6.66582 13.8867 6.66667H14.0001C14.3537 6.66667 14.6928 6.80715 14.9429 7.0572C15.1929 7.30724 15.3334 7.64638 15.3334 8C15.3334 8.35363 15.1929 8.69276 14.9429 8.94281C14.6928 9.19286 14.3537 9.33334 14.0001 9.33334H13.9401C13.7256 9.33419 13.516 9.39776 13.3371 9.51621C13.1582 9.63466 13.0179 9.80283 12.9334 10V10Z"
                                    stroke="#374151" stroke-width="1.33333" stroke-linecap="round"
                                    stroke-linejoin="round" />
                            </g>
                            <defs>
                                <clipPath id="clip0_35_70236">
                                    <rect width="16" height="16" fill="white" />
                                </clipPath>
                            </defs>
                        </svg>
                        <div class="text-4 ml-8">
                            Настроить
                        </div>
                    </div>
                </div>
            </div>
        </div>
    </div>
</template>


<script>
import MainPartLeftItem from '../main/MainPartLeftItem.vue'
export default {
    name: 'PartLeftListDelivers',
    data() {
        return {
        }
    },
    components: {
        'part-left-item': MainPartLeftItem
    }
}
</script>


<style scoped>
.mb-36 {
    margin-bottom: 36px;
}
.h-50 {
    height: 50vh;
}

.mb-34 {
    margin-bottom: 34px;
}

.ml-20 {
    margin-left: 20px;
}

.ml-10 {
    margin-left: 10px;
}

.ml-8 {
    margin-left: 8px;
}

.mr-14 {
    margin-right: 14px;
}

.mt-8 {
    margin-top: 8px;
}

.mt-36 {
    margin-top: 36px;
}

.w-205 {
    width: 205px;
}

.w-138 {
    width: 138px;
}

.test {
    width: 30px;
    height: 30px;
}

.cntr {
    display: flex;
}

.cntr-white {
    display: flex;
    flex-direction: row;
    justify-content: center;
    align-items: center;
    height: 38px;

    background: #FFFFFF;

    border: 1px solid #E5E7EB;

    box-shadow: 0px 1px 2px rgba(0, 0, 0, 0.05);
    border-radius: 6px;
}

.j-c {
    justify-content: center;
}

.a-c {
    align-items: center;
}

.a-e {
    align-items: flex-end;
}

.center {
    justify-content: space-between;
    align-items: center;
}

.cntr-v {
    display: flex;
    /* align-items:flex-end; */
}

.cntr-bg {
    background: #F9FAFB;
    width: 260px;
    height: 100vh;
}

.cntr-part-left {
    padding-top: 19px;
    padding-left: 20px;
}

.cntr-part-left-2 {
    padding-left: 10px;
}

.text-1 {
    font-family: 'Inter';
    font-style: normal;
    font-weight: 700;
    font-size: 20px;
    line-height: 24px;
    letter-spacing: -0.03em;

    text-align: left;
    color: #2563EB;
}

.text-2 {
    font-family: 'Inter';
    font-style: normal;
    font-weight: 500;
    font-size: 14px;
    line-height: 20px;
    /* identical to box height, or 143% */

    letter-spacing: 0.005em;

    /* Gray/800 */

    color: #1F2937;
}

.text-3 {
    font-family: 'Inter';
    font-style: normal;
    font-weight: 500;
    font-size: 14px;
    line-height: 20px;
    /* identical to box height, or 143% */

    letter-spacing: 0.005em;

    /* Blue/500 */

    color: #3B82F6;
    text-align: left;
}

.text-4 {
    font-family: 'Inter';
    font-style: normal;
    font-weight: 600;
    font-size: 15px;
    line-height: 18px;
    text-align: center;
    letter-spacing: 0.005em;

    /* Gray/800 */

    color: #1F2937;
}

.text-btn {
    font-family: 'Inter';
    font-style: normal;
    font-weight: 600;
    font-size: 15px;
    line-height: 18px;
    text-align: center;
    letter-spacing: 0.005em;

    /* White/White */

    color: #FFFFFF;
}

.box-btn {
    width: 73px;
    height: 38px;

    /* Gray/800 */

    background: #1F2937;
    border-radius: 6px;
}

.box-size {
    width: 210px;
    height: 36px;
}

.box-padding {
    padding-left: 14px;
    /* padding-top: 8px; */
}

.box-item {
    display: flex;
    flex-direction: column;
    justify-content: center;
    align-items: flex-start;
    /* padding: 0px; */

    width: 210px;
    height: 36px;
    text-align: left;
    margin-top: 10px;
    /* Gray/100 */


}

.box-select {
    background: #F3F4F6;
    border-radius: 6px;
}</style>